[
  {
    "id": "00",
    "title": "Trump Refuses to Sign G-7 Statement and Calls Trudeau ‘Weak’",
    "author": "Catherine Porter",
    "date": "2018-06-09",
    "text": "President Trump upended two days of global economic diplomacy late Saturday, refusing to sign a joint statement with America’s allies, threatening to escalate his trade war on the country’s neighbors and deriding Canada’s prime minister as “very dishonest and weak.”,In a remarkable pair of acrimony-laced tweets from aboard Air Force One as he flew away from the Group of 7 summit toward a meeting with North Korea’s leader, Mr. Trump lashed out at Justin Trudeau. He accused the prime minister, who hosted the seven-nation gathering, of making false statements.",
    "comments": [
      {
        "id": "01",
        "author": "Michael Roberts",
        "date": "2018-06-09",
        "text": "Literally moments after Mr. Trudeau’s government proudly released the joint statement, noting it had been agreed to by all seven countries, Mr. Trump blew apart the veneer of cordiality that had prevailed throughout the two days of meetings in a resort town on the banks of the St. Lawrence River."
      },
      {
        "id": "02",
        "author": "Michael D. Shear",
        "date": "2018-06-10",
        "text": "“Based on Justin’s false statements at his news conference, and the fact that Canada is charging massive Tariffs to our U.S. farmers, workers and companies, I have instructed our U.S. Reps not to endorse the Communique as we look at Tariffs on automobiles flooding the U.S. Market!” Mr. Trump wrote."
      },
      {
        "id": "03",
        "author": "Canadian workers",
        "date": "2018-06-10",
        "text": "Mr. Trump, who apparently saw Mr. Trudeau’s news conference on television aboard Air Force One, was clearly enraged."
      }
    ]
  },
  {
    "id": "01",
    "title": "For ‘Columbiners,’ School Shootings Have a Deadly Allure",
    "author": "Jess Bidgood",
    "date": "2018-05-30",
    "text": "SANTA FE, Tex. — The exact reasons a teenage gunman shot his fellow students and teachers here at Santa Fe High School remain a mystery. His model for carrying it out is more clear.The 17-year-old junior wore a black trench coat and fired a sawed-off shotgun, the same attire and weaponry used by the two gunmen who killed a dozen students and a teacher at Columbine High School in Colorado in 1999.",
    "comments": [
      {
        "id": "01",
        "author": "Manny Fernandez",
        "date": "2018-06-01",
        "text": "He wore a T-shirt with the phrase “Born to Kill” on it in bold, similar in design to those worn by the Columbine attackers, which read “Wrath” and “Natural Selection.”"
      },
      {
        "id": "02",
        "author": "Julie Turkewitz",
        "date": "2018-06-02",
        "text": "His crude arsenal included canisters of carbon-dioxide gas and Molotov cocktails, two types of explosives used by the Columbine gunmen."
      },
      {
        "id": "03",
        "author": "Canadian workers",
        "date": "2018-06-10",
        "text": "It was not the first time a high school suddenly engulfed in gunfire and death found itself looking for clues in the random symbology of a nearly 20-year-old mass shooting that has become, it seems, the standard by which youthful gunmen across America have come to measure themselves."
      }
    ]
  },
  {
    "id": "02",
    "title": "She Found Comfort in a Brooklyn Diner, Then Lost Everything",
    "author": "Michael Wilson",
    "date": "2018-05-27",
    "text": "Zelma Haskell had been married to her husband, Irwin, for more than 50 years, and when he died in 2003, she was lost. “He was everything to me,” she said in a recent interview, looking back over the years that followed his death — years of practically unfathomable loss and theft hidden behind the smile of a friend — to the place where it all began.",
    "comments": [
      {
        "id": "01",
        "author": "Manny Fernandez",
        "date": "2018-05-29",
        "text": "“Pretty, and so sweet,” Ms. Haskell, now 85, recalled. “I liked her immediately.”"
      }
    ]
  },
  {
    "id": "03",
    "title": "Apartments Are Stocked, Toys Donated. Only the Refugees Are Missing.",
    "author": "Miriam Jordan",
    "date": "2018-05-16",
    "text": "In Fayetteville, Ark., this March, volunteers were on their way to set up an apartment, cars loaded with linens, lamps, crockery and canned food, when they were abruptly told to turn around. The refugee family from the Democratic Republic of Congo would not be coming. In Columbus, Ohio, a 14-passenger white van that would take refugees to medical appointments sits unused. In the rare instance a newcomer or two needs transport, they travel in a fuel-efficient economy car. And in southwest Houston, a 1,500-square-foot storage room is loaded to the ceiling with furniture, toys, bedding and other items donated for refugee families, all collecting dust.",
    "comments": []
  }
]
